bash.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-24 Sat 21:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Bash</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Bash</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d15ca9">Running ways</a></li>
<li><a href="#org4491c49">Print</a>
<ul>
<li><a href="#org1253fa2"><code>echo</code></a></li>
<li><a href="#org9743bb7"><code>printf</code></a></li>
</ul>
</li>
<li><a href="#org29efd22">Variable</a>
<ul>
<li><a href="#org3ec5fee">Plain variable</a></li>
<li><a href="#orgebdeb92">Environment variable</a>
<ul>
<li><a href="#org56da627">List</a></li>
<li><a href="#orgf5d85b5">Assignment</a></li>
<li><a href="#org2136cbd">Get the length of variable's value (string)</a></li>
</ul>
</li>
<li><a href="#orga8f00c0">Mathematical operation (e.g. <code>let</code>)</a></li>
</ul>
</li>
<li><a href="#org6bf935b">Array</a></li>
<li><a href="#orgfabf25d">Alias</a></li>
<li><a href="#orgf982b00">Function</a></li>
<li><a href="#org5155f12">Test &amp; comparison</a>
<ul>
<li><a href="#org08ba9f6">Arithmetic</a></li>
<li><a href="#org93b4654">File system</a></li>
<li><a href="#org25448d3">String</a></li>
</ul>
</li>
<li><a href="#orgaf5b256">Judgement</a></li>
<li><a href="#org4a10c1d">Iteration</a></li>
<li><a href="#org0b67566">Miscellaneous</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3d15ca9" class="outline-2">
<h2 id="org3d15ca9">Running ways</h2>
<div class="outline-text-2" id="text-org3d15ca9">
<dl class="org-dl">
<dt>Make the shell script executable</dt><dd>The script should begin with the shebang (e.g. <code>#!/bin/bash</code>).</dd>
<dt>Treat the shell script as the argument of <code>sh</code></dt><dd>In this case, the shebang is not necessary.</dd>
</dl>
</div>
</div>
<div id="outline-container-org4491c49" class="outline-2">
<h2 id="org4491c49">Print</h2>
<div class="outline-text-2" id="text-org4491c49">
</div>
<div id="outline-container-org1253fa2" class="outline-3">
<h3 id="org1253fa2"><code>echo</code></h3>
<div class="outline-text-3" id="text-org1253fa2">
<ul class="org-ul">
<li>By default, a line break is appended every time it is invoked.</li>
<li>The default line break can be avoided by option <code>-n</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org9743bb7" class="outline-3">
<h3 id="org9743bb7"><code>printf</code></h3>
<div class="outline-text-3" id="text-org9743bb7">
<ul class="org-ul">
<li>Syntax</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">printf "format_list" content/variable_list
</pre>
</div>
<ul class="org-ul">
<li>Format
<ul class="org-ul">
<li><code>%s</code>
<ul class="org-ul">
<li><code>%3s</code>: 3-character wide and right alignment.</li>
<li><code>%-3s</code>: 3-character wide and left alignment.</li>
</ul></li>
<li><code>%c</code></li>
<li><code>\n</code>: line break.</li>
<li><code>%f</code>
<ul class="org-ul">
<li><code>%5.2f</code>: 5-character wide with 2 of them for decimal portion, right alignment.</li>
<li><code>%-5.2f</code>: 5-character wide with 2 of them for decimal portion, left alignment.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org29efd22" class="outline-2">
<h2 id="org29efd22">Variable</h2>
<div class="outline-text-2" id="text-org29efd22">
<p>
In Bash, every variable is a string.
</p>
</div>
<div id="outline-container-org3ec5fee" class="outline-3">
<h3 id="org3ec5fee">Plain variable</h3>
<div class="outline-text-3" id="text-org3ec5fee">
<p>
Assignment
</p>
<div class="org-src-container">
<pre class="src src-sh">var_name=var_value
</pre>
</div>
</div>
</div>
<div id="outline-container-orgebdeb92" class="outline-3">
<h3 id="orgebdeb92">Environment variable</h3>
<div class="outline-text-3" id="text-orgebdeb92">
</div>
<div id="outline-container-org56da627" class="outline-4">
<h4 id="org56da627">List</h4>
<div class="outline-text-4" id="text-org56da627">
<div class="org-src-container">
<pre class="src src-sh">cat /proc/$PID/environ
</pre>
</div>
<p>
where <code>$PID</code> is an integer and can be obtained by <code>pgrep</code>, e.g.
</p>
<div class="org-src-container">
<pre class="src src-sh">pgrep emacs
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5d85b5" class="outline-4">
<h4 id="orgf5d85b5">Assignment</h4>
<div class="outline-text-4" id="text-orgf5d85b5">
<div class="org-src-container">
<pre class="src src-sh">env_var_name=value
export env_var_name
...
export env_var_name=value
</pre>
</div>
<ul class="org-ul">
<li><code>$SHELL</code> or <code>$0</code></li>
<li><code>$UID</code></li>
<li><code>$?</code> indicates the exit state of last command.
<ul class="org-ul">
<li><b>0</b> means successfully executed</li>
<li><b>Others</b> mean failure</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2136cbd" class="outline-4">
<h4 id="org2136cbd">Get the length of variable's value (string)</h4>
<div class="outline-text-4" id="text-org2136cbd">
<div class="org-src-container">
<pre class="src src-sh">${#var_name}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8f00c0" class="outline-3">
<h3 id="orga8f00c0">Mathematical operation (e.g. <code>let</code>)</h3>
<div class="outline-text-3" id="text-orga8f00c0">
<p>
<code>$</code> in front of variable name is not needed.
</p>
<div class="org-src-container">
<pre class="src src-sh">let var=var1+var2
...
let var++
let var+=1
let var=var+1
...
let var--
let var-=1
let var=var-1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6bf935b" class="outline-2">
<h2 id="org6bf935b">Array</h2>
<div class="outline-text-2" id="text-org6bf935b">
<div class="org-src-container">
<pre class="src src-sh">array_var=(0, 1, 2, 3, 6)
...
echo #{array_var[0]}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfabf25d" class="outline-2">
<h2 id="orgfabf25d">Alias</h2>
<div class="outline-text-2" id="text-orgfabf25d">
<div class="org-src-container">
<pre class="src src-sh">alias new_command='command sequence'
...
new_command
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf982b00" class="outline-2">
<h2 id="orgf982b00">Function</h2>
<div class="outline-text-2" id="text-orgf982b00">
<div class="org-src-container">
<pre class="src src-sh">function func_name()
{
statements
}
...
func_name()
{
statements
}
...
func_name arg_list
</pre>
</div>
<ul class="org-ul">
<li><code>$0</code>: script name.</li>
<li><code>$n</code>: the <code>n</code>-th argument, n=1, 2, &#x2026;</li>
<li><code>$@</code>: "$1" "$2" "$3"</li>
<li><code>$*</code>: "$1c$2c$3", where <code>c</code> is the 1st character of <i>IFS</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-org5155f12" class="outline-2">
<h2 id="org5155f12">Test &amp; comparison</h2>
<div class="outline-text-2" id="text-org5155f12">
</div>
<div id="outline-container-org08ba9f6" class="outline-3">
<h3 id="org08ba9f6">Arithmetic</h3>
<div class="outline-text-3" id="text-org08ba9f6">
<div class="org-src-container">
<pre class="src src-sh">[ $var -eq 0 ]
[ $var -ne 0 ]
[ $var -gt 0 ]
[ $var -ge 0 ]
[ $var -lt 0 ]
[ $var -le 0 ]
[ $var1 -ne 0 -a $var2 -lt 1 ]
[ $var1 -ne 0 -o $var2 -lt 1 ]
</pre>
</div>
</div>
</div>
<div id="outline-container-org93b4654" class="outline-3">
<h3 id="org93b4654">File system</h3>
<div class="outline-text-3" id="text-org93b4654">
<div class="org-src-container">
<pre class="src src-sh">[ -f $var ] # is $var a file?
[ -d $var ] # is $var a directory?
[ -x $var ] # is $var executable?
[ -e $var ] # does $var exist?
[ -w $var ] # is $var writable?
[ -r $var ] # is $var readable?
[ -L $var ] # is $var a symbolic link?
[ -b $var ] # is $var a block device?
[ -c $var ] # is $var a character device?
</pre>
</div>
</div>
</div>
<div id="outline-container-org25448d3" class="outline-3">
<h3 id="org25448d3">String</h3>
<div class="outline-text-3" id="text-org25448d3">
<div class="org-src-container">
<pre class="src src-sh">[[ -z $str ]] # is $str an empty string?
[[ -n $str ]] # is $str a non-empty string?
[[ $str1==$str2 ]]
[[ $str1!=$str2 ]]
[[ $str1&gt;$str2 ]]
[[ $str1&lt;$str2 ]]
[[ -n $str1 ]] &amp;&amp; [[ -z $str2 ]]
[[ -n $str1 ]] || [[ -z $str2 ]]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaf5b256" class="outline-2">
<h2 id="orgaf5b256">Judgement</h2>
<div class="outline-text-2" id="text-orgaf5b256">
<div class="org-src-container">
<pre class="src src-sh">if condition; then
commands
fi
...
[ condition ] &amp;&amp; command
...
[ condition ] || command
...
if condition; then
commands1
else
commands2
fi
...
if condition1; then
commands1
elif condition2; then
commands2
else
commands3
fi
</pre>
</div>
</div>
</div>
<div id="outline-container-org4a10c1d" class="outline-2">
<h2 id="org4a10c1d">Iteration</h2>
<div class="outline-text-2" id="text-org4a10c1d">
<div class="org-src-container">
<pre class="src src-sh">for var in list;
do
commands # use $var
done
...
while condition
do
commands # use $var
done
...
until condition
do
commands # use $var
done
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b67566" class="outline-2">
<h2 id="org0b67566">Miscellaneous</h2>
<div class="outline-text-2" id="text-org0b67566">
<ul class="org-ul">
<li>Commands are seperated by semicolon (;) or line break.</li>
<li><i>File descriptor</i> is an abstract pointer for file access.</li>
<li>Internal field separator (IFS)
<ul class="org-ul">
<li><code>$IFS</code> is the environment variable to store IFS.</li>
<li>Default values: space, table, line break.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
